window.GT_CONFIG = {
    "ACCOUNTS": [
        {
            "user": "admin",
            "pass": "zodiac1612@",
            "role": "admin",
            "tabs": ["coil", "psychro", "modex", "modex-gt", "modex-g", "modex-k"]
        },
        {
            "user": "User",
            "pass": "1997",
            "role": "user",
            "tabs": ["coil", "psychro", "modex", "modex-gt"]
        },
        {
            "user": "User01",
            "pass": "2026",
            "role": "user",
            "tabs": ["modex", "modex-gt"]
        }
    ],
    "TUBE_SPECS": {
        "D16_45": {
            "d_ngoai": 16,
            "d_lo": 16.35,
            "d_dt": 17,
            "b_n": 45,
            "b_d": 45,
            "thick": 0.48,
            "h_rut": 0.012,
            "d_han": 20,
            "mass_per_m": 0.21
        },
        "D16_50": {
            "d_ngoai": 16,
            "d_lo": 16.35,
            "d_dt": 17,
            "b_n": 50,
            "b_d": 50,
            "thick": 0.48,
            "h_rut": 0.012,
            "d_han": 40,
            "mass_per_m": 0.21
        },
        "D127_31": {
            "d_ngoai": 12.7,
            "d_lo": 13.1,
            "d_dt": 0,
            "b_n": 27.5,
            "b_d": 31.75,
            "thick": 0.4,
            "h_rut": 0.014,
            "d_han": 20,
            "mass_per_m": 0.144
        },
        "D127_50": {
            "d_ngoai": 12.7,
            "d_lo": 13.1,
            "d_dt": 0,
            "b_n": 25,
            "b_d": 50,
            "thick": 0.4,
            "h_rut": 0.014,
            "d_han": 20,
            "mass_per_m": 0.144
        },
        "D96": {
            "d_ngoai": 9.6,
            "d_lo": 9.85,
            "d_dt": 0,
            "b_n": 22,
            "b_d": 25.4,
            "thick": 0.4,
            "h_rut": 0.013,
            "d_han": 15,
            "mass_per_m": 0.104
        },
        "Inox16": {
            "d_ngoai": 16,
            "d_lo": 16.35,
            "d_dt": 17,
            "b_n": 50,
            "b_d": 50,
            "thick": 0.6,
            "h_rut": 0.015,
            "d_han": 70,
            "mass_per_m": 0.23
        },
        "Inox16_45": {
            "d_ngoai": 16,
            "d_lo": 16.35,
            "d_dt": 17,
            "b_n": 45,
            "b_d": 45,
            "thick": 0.6,
            "h_rut": 0.015,
            "d_han": 70,
            "mass_per_m": 0.23
        },
        "Inox22": {
            "d_ngoai": 22,
            "d_lo": 22.5,
            "d_dt": 0,
            "b_n": 60,
            "b_d": 51.96,
            "thick": 0.7,
            "h_rut": 0.015,
            "d_han": 70,
            "mass_per_m": 0
        }
    },
    "FIN_WEIGHT_COEFFS": {
        "D127_31_31.75x27.5_Nhôm Epoxy_0.15": {
            "coeff": 0.000382,
            "kho_nhom": 175
        },
        "D127_50_50x25_Nhôm thường_0.18": {
            "coeff": 0.000657,
            "kho_nhom": 225
        },
        "D127_31_31.75x27.5_Nhôm thường_0.15": {
            "coeff": 0.000381,
            "kho_nhom": 180
        },
        "D16_45_45x45_Nhôm thường_0.25": {
            "coeff": 0.00153,
            "kho_nhom": 195
        },
        "D16_45_45x45_Nhôm thường_0.28": {
            "coeff": 0.00171,
            "kho_nhom": 195
        },
        "D16_50_50x50_Nhôm thường_0.28": {
            "coeff": 0.00205,
            "kho_nhom": 215
        },
        "D16_50_50x50_Nhôm thường_0.33": {
            "coeff": 0.00274,
            "kho_nhom": 215
        },
        "D16_50_50x50_Nhôm AlMg2.5_0.28": {
            "coeff": 0.00219,
            "kho_nhom": 215
        },
        "D96_25.4x22_Nhôm Epoxy_0.15": {
            "coeff": 0.00027,
            "kho_nhom": 145
        },
        "D96_25.4x22_Nhôm mạ màu_0.12": {
            "coeff": 0.000199,
            "kho_nhom": 145
        },
        "D16_45_45x45_Nhôm Epoxy_0.2": {
            "coeff": 0.00138,
            "kho_nhom": 190
        },
        "D16_50_50x50_Nhôm Epoxy_0.2": {
            "coeff": 0.00144,
            "kho_nhom": 215
        },
        "D16_50_50x50_Nhôm Epoxy_0.28": {
            "coeff": 0.0022,
            "kho_nhom": 215
        },
        "D16_45_45x45_Inox 304_0.152": {
            "coeff": 0.00262,
            "kho_nhom": 190
        },
        "D16_45_45x45_Inox 304_0.15": {
            "coeff": 0.00306,
            "kho_nhom": 190
        },
        "D96_25.4x22_Đồng_0.17": {
            "coeff": 0.00095,
            "kho_nhom": 145
        },
        "D127_31_31.75x27.5_Đồng_0.15": {
            "coeff": 0.00126,
            "kho_nhom": 180
        },
        "Inox16_50x50_Nhôm thường_0.28": {
            "coeff": 0.00205,
            "kho_nhom": 215
        },
        "Inox16_50x50_Nhôm thường_0.33": {
            "coeff": 0.00274,
            "kho_nhom": 215
        },
        "Inox16_50x50_Nhôm AlMg2.5_0.28": {
            "coeff": 0.00223,
            "kho_nhom": 215
        },
        "Inox16_50x50_Nhôm AlMg2.5_0.33": {
            "coeff": 0.00298,
            "kho_nhom": 215
        },
        "Inox16_50x50_Nhôm Epoxy_0.2": {
            "coeff": 0.00144,
            "kho_nhom": 215
        },
        "Inox16_50x50_Nhôm Epoxy_0.28": {
            "coeff": 0.0022,
            "kho_nhom": 215
        },
        "Inox16_45_45x45_Nhôm Epoxy_0.2": {
            "coeff": 0.00138,
            "kho_nhom": 190
        },
        "Inox16_45_45x45_Nhôm thường_0.25": {
            "coeff": 0.00153,
            "kho_nhom": 195
        },
        "Inox16_45_45x45_Nhôm thường_0.28": {
            "coeff": 0.00171,
            "kho_nhom": 195
        }
    },
    "FANS": {
        "ZA": {
            "FN040": {
                "name": "FN040 Ø400",
                "details": "FN040-VDK.0F.V7P2 - D/Y (0.26/0.18kW - 0.5/0.29A - 1340/1020min)",
                "modes": {
                    "Tam giác (Δ)": {
                        "0": 4400,
                        "20": 4200,
                        "40": 3900,
                        "60": 3600
                    },
                    "Sao (Y)": {
                        "0": 3600,
                        "20": 3300,
                        "40": 2700,
                        "60": 2000
                    }
                }
            },
            "FN045": {
                "name": "FN045 Ø450",
                "details": "FN045-VDK.2F.V7P2 - D/Y (0.35/0.22kW - 0.64/0.35A - 1280/970min)",
                "modes": {
                    "Tam giác (Δ)": {
                        "0": 5400,
                        "20": 5200,
                        "40": 4800,
                        "60": 4400
                    },
                    "Sao (Y)": {
                        "0": 4300,
                        "20": 3800,
                        "40": 3500
                    }
                }
            },
            "FN050": {
                "name": "FN050 Ø500",
                "details": "FN050-VDK.4I.V7P1 - D/Y (0.77/0.49kW - 1.7/0.84A - 1300/1025min)",
                "modes": {
                    "Tam giác (Δ)": {
                        "0": 8000,
                        "20": 7800,
                        "40": 7500,
                        "60": 7200,
                        "80": 6900,
                        "100": 6500
                    },
                    "Sao (Y)": {
                        "0": 6600,
                        "20": 6200,
                        "40": 5900,
                        "60": 5400,
                        "80": 4800
                    }
                }
            },
            "FN056": {
                "name": "FN056 Ø560",
                "details": "FN056-VDK.4M.V7P2 - D/Y (1.05/0.58kW - 2.2/1.1A - 1280/910min)",
                "modes": {
                    "Tam giác (Δ)": {
                        "0": 10300,
                        "20": 10000,
                        "40": 9700,
                        "60": 9400,
                        "80": 9000,
                        "100": 8500,
                        "120": 8000,
                        "150": 7000
                    },
                    "Sao (Y)": {
                        "0": 8000,
                        "20": 7500,
                        "40": 7000,
                        "60": 6000
                    }
                }
            },
            "FN063": {
                "name": "FN063 Ø630",
                "details": "FN063-VDK.6N.V7P7 - D/Y (2.7/1.75kW - 5.0/3.0A - 1330/1040min)",
                "modes": {
                    "Tam giác (Δ)": {
                        "0": 17700,
                        "20": 17200,
                        "40": 17000,
                        "60": 16500,
                        "80": 16200,
                        "100": 15900,
                        "120": 15500,
                        "150": 14800,
                        "180": 14000
                    },
                    "Sao (Y)": {
                        "0": 14200,
                        "20": 13800,
                        "40": 13300,
                        "60": 12900,
                        "80": 12100,
                        "100": 11500,
                        "120": 10500
                    }
                }
            }
        },
        "TQ": {
            "D300": {
                "name": "YDWF Ø300",
                "details": "YDWF68L35P4-360N-300PA S (cánh nhựa-lồng inox) - (0.085kW - 0.39A - 1320min) - 57dB",
                "modes": {
                    "Mặc định": {
                        "0": 1700,
                        "20": 1400,
                        "40": 780,
                        "50": 650
                    }
                }
            },
            "D350": {
                "name": "YDWF Ø350",
                "details": "YDWF74L34P4-422N-350PA S (cánh nhựa-lồng inox) - (0.162kW - 0.67A - 1329min) - 62dB",
                "modes": {
                    "Mặc định": {
                        "0": 2890,
                        "20": 2700,
                        "40": 2400,
                        "60": 2100
                    }
                }
            },
            "D400": {
                "name": "YSWF Ø400",
                "details": "YSWF74L60P4-470N-400S (cánh inox-lồng inox) - D/Y (0.227/0.175kW - 0.52/0.3A - 1382/1111min) - 68dB/65dB",
                "modes": {
                    "Tam giác (Δ)": {
                        "0": 4000,
                        "20": 3800,
                        "40": 3500,
                        "60": 3200,
                        "80": 2700
                    },
                    "Sao (Y)": {
                        "0": 3800,
                        "20": 3400,
                        "40": 2700,
                        "60": 2400,
                        "80": 1200
                    }
                }
            },
            "D450": {
                "name": "YSWF Ø450",
                "details": "YSWF74L60P4-522N-450S (cánh inox-lồng inox) - D/Y (0.267/0.197kW - 0.59/0.33A - 1372/1090min) - 60dB/60dB",
                "modes": {
                    "Tam giác (Δ)": {
                        "0": 4800,
                        "20": 4500,
                        "40": 4200,
                        "60": 3900,
                        "80": 3500
                    },
                    "Sao (Y)": {
                        "0": 4200,
                        "20": 3700,
                        "40": 3500,
                        "60": 2200,
                        "80": 1400
                    }
                }
            },
            "D500": {
                "name": "YSWF Ø500",
                "details": "YSWF102L50P4-570N-500S (cánh inox-lồng inox) - D/Y (0.645/0.511kW - 1.37/0.84A - 1393/1192min) - 73dB/68dB",
                "modes": {
                    "Tam giác (Δ)": {
                        "0": 8000,
                        "20": 7700,
                        "40": 7500,
                        "60": 7100,
                        "80": 6700,
                        "100": 6500,
                        "120": 6000
                    },
                    "Sao (Y)": {
                        "0": 7300,
                        "20": 6700,
                        "40": 6300,
                        "60": 5800,
                        "80": 5300,
                        "100": 4700,
                        "120": 3800
                    }
                }
            },
            "D550": {
                "name": "YSWF Ø550",
                "details": "YSWF102L50P4-625N-550S (cánh inox-lồng inox) - D/Y (0.67/0.507kW - 1.27/0.82A - 1377/1105min) - 74dB/71dB",
                "modes": {
                    "Tam giác (Δ)": {
                        "0": 8500,
                        "20": 8400,
                        "40": 8000,
                        "60": 7700,
                        "80": 7200,
                        "100": 6900,
                        "120": 6400,
                        "150": 5500
                    },
                    "Sao (Y)": {
                        "0": 7500,
                        "20": 7100,
                        "40": 6600,
                        "60": 5900,
                        "80": 5100,
                        "100": 4400,
                        "120": 3200
                    }
                }
            },
            "D600": {
                "name": "YSWF Ø600",
                "details": "YSWF102L60P4-675N-600S (cánh inox-lồng inox) - D/Y (0.825/0.603kW - 1.56/0.98A - 1365/1125min) - 75dB/74dB",
                "modes": {
                    "Tam giác (Δ)": {
                        "0": 10400,
                        "20": 10100,
                        "40": 9800,
                        "60": 9500,
                        "80": 9000,
                        "100": 8600,
                        "120": 8100,
                        "150": 7200
                    },
                    "Sao (Y)": {
                        "0": 9100,
                        "20": 8600,
                        "40": 8000,
                        "60": 7500,
                        "80": 6800,
                        "100": 5800,
                        "120": 4300
                    }
                }
            },
            "D630": {
                "name": "YSWF Ø630",
                "details": "YSWF127L65P4-753N-630S (cánh inox-lồng inox) - D/Y (1.646/1.425kW - 3.3/2.25A - 1392/1215min) - 78dB/75dB",
                "modes": {
                    "Tam giác (Δ)": {
                        "0": 15000,
                        "20": 14800,
                        "40": 14300,
                        "60": 14000,
                        "80": 13500,
                        "100": 13000,
                        "120": 12500,
                        "150": 11700,
                        "180": 10500
                    },
                    "Sao (Y)": {
                        "0": 14200,
                        "20": 13800,
                        "40": 13100,
                        "60": 12800,
                        "80": 12000,
                        "100": 11500,
                        "120": 10800,
                        "150": 9300
                    }
                }
            }
        },
        "KRUGER": {
            "TDA630": {
                "name": "TDA Ø630",
                "details": "TDA630-12AA-5-5/30 - (2.2kW-5A-94db) - 55kg - L630mm x H750mm",
                "modes": {
                    "Mặc định": {
                        "80": 15800,
                        "120": 14500,
                        "150": 13200
                    }
                }
            },
            "TDA710_3": {
                "name": "TDA Ø710 (3kW)",
                "details": "TDA710-12AA-7-7/26  (3kW-6.8A-97db) - 80kg - L720mm x H840mm",
                "modes": {
                    "Mặc định": {
                        "80": 22400,
                        "120": 21500,
                        "150": 20800
                    }
                }
            },
            "TDA710_4": {
                "name": "TDA Ø710 (4kW)",
                "details": "TDA710-12AA-7-7/30  (4kW-98db) - L720mm x H840mm",
                "modes": {
                    "Mặc định": {
                        "80": 25000,
                        "120": 24000,
                        "150": 23400
                    }
                }
            },
            "TDA800": {
                "name": "TDA Ø800 (5.5kW)",
                "details": "TDA800-12AA-7-7/28  (5.5kW-11A-101db) - 110kg - L800mm x H930mm",
                "modes": {
                    "Mặc định": {
                        "80": 34000,
                        "120": 33200,
                        "150": 32000
                    }
                }
            }
        }
    },
    "STANDARD_COILS": {
        "400": { "cao": 10, "dai_1_quat": 750, "dai_3_quat": 2300 },
        "450": { "cao": 12, "dai_1_quat": 850, "dai_3_quat": 2550 },
        "500": { "cao": 14, "dai_1_quat": 1000, "dai_3_quat": 3000 },
        "560": { "cao": 16, "dai_1_quat": 1150, "dai_3_quat": 3400 },
        "600": { "cao": 16, "dai_1_quat": 1150 },
        "630": { "cao": 18, "dai_1_quat": 1275, "dai_3_quat": 3700 }
    }
};
